HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxMinimcds_regdef.h
/** \\brief  Comparator Sign Register */
typedef struct _Ifx_MINIMCDS_TCXWD_SGN_Bits
{
    Ifx_Strict_32Bit SIGN:5;                /**< \brief [4:0] Bit number (1...31) of sign bit (rw) */
    Ifx_Strict_32Bit reserved_5:27;         /**< \brief \internal Reserved */
} Ifx_MINIMCDS_TCXWD_SGN_Bits;

/** \\brief  Clock Counter Register */
typedef struct _Ifx_MINIMCDS_TSUEMUCNT_Bits
{
    Ifx_Strict_32Bit COUNT:32;              /**< \brief [31:0] Current Count Value (rh) */
} Ifx_MINIMCDS_TSUEMUCNT_Bits;

/** \\brief  Clock Prescaler Register */
typedef struct _Ifx_MINIMCDS_TSUPRSCL_Bits
{
    Ifx_Strict_32Bit RELOAD:32;             /**< \brief [31:0] Prescaler Reload Value (rw) */
} Ifx_MINIMCDS_TSUPRSCL_Bits;

/** \\brief  Clock Counter Register */
typedef struct _Ifx_MINIMCDS_TSUREFCNT_Bits
{
    Ifx_Strict_32Bit COUNT:32;              /**< \brief [31:0] Current Count Value (rh) */
} Ifx_MINIMCDS_TSUREFCNT_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Minimcds_union
 * \{  */

/** \\brief  Action Definition Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MINIMCDS_ACT_Bits B;
} Ifx_MINIMCDS_ACT;

/** \\brief  Clock Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MINIMCDS_CLC_Bits B;
} Ifx_MINIMCDS_CLC;

/** \\brief  Counter Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MINIMCDS_CNT_CCL_Bits B;
} Ifx_MINIMCDS_CNT_CCL;

/** \\brief  Current Count Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MINIMCDS_CNT_CNT_Bits B;
} Ifx_MINIMCDS_CNT_CNT;

/** \\brief  Counter Limit Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MINIMCDS_CNT_LMT_Bits B;
} Ifx_MINIMCDS_CNT_LMT;

/** \\brief  MCDS Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MINIMCDS_CT_Bits B;
} Ifx_MINIMCDS_CT;

/** \\brief  Event Definition Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MINIMCDS_EVT_Bits B;
} Ifx_MINIMCDS_EVT;

/** \\brief  Trace Buffer Bottom Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MINIMCDS_FIFOBOT_Bits B;
} Ifx_MINIMCDS_FIFOBOT;

/** \\brief  Trace Buffer Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MINIMCDS_FIFOCTL_Bits B;
} Ifx_MINIMCDS_FIFOCTL;

/** \\brief  Trace Buffer Write Pointer */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MINIMCDS_FIFONOW_Bits B;
} Ifx_MINIMCDS_FIFONOW;

/** \\brief  Trace Buffer PRE/POST Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MINIMCDS_FIFOPRE_Bits B;
} Ifx_MINIMCDS_FIFOPRE;

/** \\brief  Trace Buffer Top Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MINIMCDS_FIFOTOP_Bits B;
} Ifx_MINIMCDS_FIFOTOP;

/** \\brief  Trace Buffer Comparator Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MINIMCDS_FIFOWARN0_Bits B;
} Ifx_MINIMCDS_FIFOWARN0;

/** \\brief  Trace Buffer Comparator Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MINIMCDS_FIFOWARN1_Bits B;
} Ifx_MINIMCDS_FIFOWARN1;

/** \\brief  Module Identification Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MINIMCDS_ID_Bits B;
} Ifx_MINIMCDS_ID;

/** \\brief  MCDS Signal Source Control */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MINIMCDS_MUX_Bits B;
} Ifx_MINIMCDS_MUX;

/** \\brief  OCDS Control and Status */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MINIMCDS_OCS_Bits B;
} Ifx_MINIMCDS_OCS;

/** \\brief  Compact Function Trace Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MINIMCDS_TCX_CFT_Bits B;
} Ifx_MINIMCDS_TCX_CFT;

/** \\brief  Current Instruction Pointer */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MINIMCDS_TCX_CIP_Bits B;
} Ifx_MINIMCDS_TCX_CIP;

/** \\brief  Debug Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MINIMCDS_TCX_DCSTS_Bits B;
} Ifx_MINIMCDS_TCX_DCSTS;

/** \\brief  Comparator Bound Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MINIMCDS_TCXEA_BND_Bits B;
} Ifx_MINIMCDS_TCXEA_BND;

/** \\brief  Comparator Range Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MINIMCDS_TCXEA_RNG_Bits B;
} Ifx_MINIMCDS_TCXEA_RNG;

/** \\brief  Comparator Bound Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MINIMCDS_TCXIP_BND_Bits B;
} Ifx_MINIMCDS_TCXIP_BND;

/** \\brief  Comparator Range Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MINIMCDS_TCXIP_RNG_Bits B;
} Ifx_MINIMCDS_TCXIP_RNG;

/** \\brief  Comparator Bound Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MINIMCDS_TCXWD_BND_Bits B;
} Ifx_MINIMCDS_TCXWD_BND;

/** \\brief  Comparator Mask Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MINIMCDS_TCXWD_MSK_Bits B;
} Ifx_MINIMCDS_TCXWD_MSK;

/** \\brief  Comparator Range Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MINIMCDS_TCXWD_RNG_Bits B;
} Ifx_MINIMCDS_TCXWD_RNG;

