HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxMinimcds_regdef.h
/** \\brief  Comparator Sign Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MINIMCDS_TCXWD_SGN_Bits B;
} Ifx_MINIMCDS_TCXWD_SGN;

/** \\brief  Clock Counter Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MINIMCDS_TSUEMUCNT_Bits B;
} Ifx_MINIMCDS_TSUEMUCNT;

/** \\brief  Clock Prescaler Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MINIMCDS_TSUPRSCL_Bits B;
} Ifx_MINIMCDS_TSUPRSCL;

/** \\brief  Clock Counter Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MINIMCDS_TSUREFCNT_Bits B;
} Ifx_MINIMCDS_TSUREFCNT;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Minimcds_struct
 * \{  */
/******************************************************************************/
/** \name Object L2
 * \{  */

/** \\brief  Counter objects */
typedef volatile struct _Ifx_MINIMCDS_CNT
{
    Ifx_MINIMCDS_CNT_CCL CCL;               /**< \brief 0, Counter Control Register */
    Ifx_MINIMCDS_CNT_LMT LMT;               /**< \brief 4, Counter Limit Register */
    Ifx_MINIMCDS_CNT_CNT CNT;               /**< \brief 8, Current Count Register */
    unsigned char reserved_C[4];            /**< \brief C, \internal Reserved */
} Ifx_MINIMCDS_CNT;

/** \\brief  Comparator objects */
typedef volatile struct _Ifx_MINIMCDS_TCXEA
{
    Ifx_MINIMCDS_TCXEA_BND BND;             /**< \brief 0, Comparator Bound Register */
    Ifx_MINIMCDS_TCXEA_RNG RNG;             /**< \brief 4, Comparator Range Register */
    unsigned char reserved_8[8];            /**< \brief 8, \internal Reserved */
} Ifx_MINIMCDS_TCXEA;

/** \\brief  Comparator objects */
typedef volatile struct _Ifx_MINIMCDS_TCXIP
{
    Ifx_MINIMCDS_TCXIP_BND BND;             /**< \brief 0, Comparator Bound Register */
    Ifx_MINIMCDS_TCXIP_RNG RNG;             /**< \brief 4, Comparator Range Register */
    unsigned char reserved_8[8];            /**< \brief 8, \internal Reserved */
} Ifx_MINIMCDS_TCXIP;

/** \\brief  Comparator objects */
typedef volatile struct _Ifx_MINIMCDS_TCXWD
{
    Ifx_MINIMCDS_TCXWD_BND BND;             /**< \brief 0, Comparator Bound Register */
    unsigned char reserved_4[4];            /**< \brief 4, \internal Reserved */
    Ifx_MINIMCDS_TCXWD_RNG RNG;             /**< \brief 8, Comparator Range Register */
    unsigned char reserved_C[4];            /**< \brief C, \internal Reserved */
    Ifx_MINIMCDS_TCXWD_MSK MSK;             /**< \brief 10, Comparator Mask Register */
    unsigned char reserved_14[8];           /**< \brief 14, \internal Reserved */
    Ifx_MINIMCDS_TCXWD_SGN SGN;             /**< \brief 1C, Comparator Sign Register */
} Ifx_MINIMCDS_TCXWD;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Minimcds_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */

/** \\brief  MCX object */
typedef volatile struct _Ifx_MINIMCDS_MCX
{
    Ifx_MINIMCDS_EVT EVT[16];               /**< \brief 0, Event Definition Register */
    unsigned char reserved_40[64];          /**< \brief 40, \internal Reserved */
    Ifx_MINIMCDS_ACT ACT[41];               /**< \brief 80, Action Definition Register */
    unsigned char reserved_124[220];        /**< \brief 124, \internal Reserved */
    Ifx_MINIMCDS_CNT CNT[8];                /**< \brief 200, Counter objects */
} Ifx_MINIMCDS_MCX;

/** \\brief  TCX object */
typedef volatile struct _Ifx_MINIMCDS_TCX
{
    Ifx_MINIMCDS_TCX_DCSTS DCSTS;           /**< \brief 0, Debug Status Register */
    unsigned char reserved_4[4];            /**< \brief 4, \internal Reserved */
    Ifx_MINIMCDS_TCX_CIP CIP;               /**< \brief 8, Current Instruction Pointer */
    Ifx_MINIMCDS_TCX_CFT CFT;               /**< \brief C, Compact Function Trace Register */
    unsigned char reserved_10[1008];        /**< \brief 10, \internal Reserved */
    Ifx_MINIMCDS_TCXEA EA[2];               /**< \brief 400, Comparator objects */
    unsigned char reserved_420[96];         /**< \brief 420, \internal Reserved */
    Ifx_MINIMCDS_TCXWD WD[2];               /**< \brief 480, Comparator objects */
    unsigned char reserved_4C0[2880];       /**< \brief 4C0, \internal Reserved */
    Ifx_MINIMCDS_TCXIP IP[2];               /**< \brief 1000, Comparator objects */
} Ifx_MINIMCDS_TCX;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Minimcds_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \\brief  MINIMCDS object */
typedef volatile struct _Ifx_MINIMCDS
{
    Ifx_MINIMCDS_CLC CLC;                   /**< \brief 0, Clock Control Register */
    Ifx_MINIMCDS_OCS OCS;                   /**< \brief 4, OCDS Control and Status */
    Ifx_MINIMCDS_ID ID;                     /**< \brief 8, Module Identification Register */
    unsigned char reserved_C[4];            /**< \brief C, \internal Reserved */
    Ifx_MINIMCDS_CT CT;                     /**< \brief 10, MCDS Control Register */
    Ifx_MINIMCDS_MUX MUX;                   /**< \brief 14, MCDS Signal Source Control */
    unsigned char reserved_18[488];         /**< \brief 18, \internal Reserved */
    Ifx_MINIMCDS_FIFONOW FIFONOW;           /**< \brief 200, Trace Buffer Write Pointer */
    Ifx_MINIMCDS_FIFOBOT FIFOBOT;           /**< \brief 204, Trace Buffer Bottom Register */
    Ifx_MINIMCDS_FIFOPRE FIFOPRE;           /**< \brief 208, Trace Buffer PRE/POST Register */
    Ifx_MINIMCDS_FIFOTOP FIFOTOP;           /**< \brief 20C, Trace Buffer Top Register */
    Ifx_MINIMCDS_FIFOCTL FIFOCTL;           /**< \brief 210, Trace Buffer Control Register */
    Ifx_MINIMCDS_FIFOWARN0 FIFOWARN0;       /**< \brief 214, Trace Buffer Comparator Register */
    Ifx_MINIMCDS_FIFOWARN1 FIFOWARN1;       /**< \brief 218, Trace Buffer Comparator Register */
    unsigned char reserved_21C[484];        /**< \brief 21C, \internal Reserved */
    Ifx_MINIMCDS_TSUREFCNT TSUREFCNT;       /**< \brief 400, Clock Counter Register */
    Ifx_MINIMCDS_TSUPRSCL TSUPRSCL;         /**< \brief 404, Clock Prescaler Register */
    Ifx_MINIMCDS_TSUEMUCNT TSUEMUCNT;       /**< \brief 408, Clock Counter Register */
    unsigned char reserved_40C[1012];       /**< \brief 40C, \internal Reserved */
    Ifx_MINIMCDS_MCX MCX;                   /**< \brief 800, MCX object */
    unsigned char reserved_A80[5504];       /**< \brief A80, \internal Reserved */
    Ifx_MINIMCDS_TCX TCX;                   /**< \brief 2000, TCX object */
    unsigned char reserved_3020[4064];      /**< \brief 3020, \internal Reserved */
} Ifx_MINIMCDS;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXMINIMCDS_REGDEF_H */
